fio-test/results/14jobs_10worker/10-psync-5.out
job1: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 10 processes

job1: (groupid=0, jobs=10): err= 0: pid=9155: Wed Aug 21 13:47:52 2024
  write: IOPS=4146, BW=4147MiB/s (4348MB/s)(841GiB/207781msec); 0 zone resets
    clat (usec): min=528, max=12637, avg=2343.08, stdev=395.20
     lat (usec): min=584, max=12683, avg=2407.26, stdev=388.24
    clat percentiles (usec):
     |  1.00th=[ 1827],  5.00th=[ 1893], 10.00th=[ 1926], 20.00th=[ 2057],
     | 30.00th=[ 2180], 40.00th=[ 2278], 50.00th=[ 2343], 60.00th=[ 2409],
     | 70.00th=[ 2474], 80.00th=[ 2507], 90.00th=[ 2606], 95.00th=[ 2704],
     | 99.00th=[ 4490], 99.50th=[ 4752], 99.90th=[ 5080], 99.95th=[ 5145],
     | 99.99th=[ 5407]
   bw (  MiB/s): min= 3515, max= 5040, per=100.00%, avg=4150.63, stdev=27.16, samples=4150
   iops        : min= 3508, max= 5040, avg=4149.37, stdev=27.15, samples=4150
  lat (usec)   : 750=0.01%, 1000=0.02%
  lat (msec)   : 2=15.53%, 4=83.07%, 10=1.37%, 20=0.01%
  cpu          : usr=2.93%, sys=2.56%, ctx=861706, majf=0, minf=175
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,861600,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4147MiB/s (4348MB/s), 4147MiB/s-4147MiB/s (4348MB/s-4348MB/s), io=841GiB (903GB), run=207781-207781msec

Disk stats (read/write):
    dm-0: ios=0/861007, merge=0/0, ticks=0/1941240, in_queue=1941240, util=100.00%, aggrios=5/430800, aggrmerge=0/0, aggrticks=0/43682, aggrin_queue=43683, aggrutil=100.00%
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme3n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme1n2: ios=13/861600, merge=0/0, ticks=1/87759, in_queue=87761, util=100.00%
  nvme4n2: ios=6/861600, merge=0/0, ticks=1/87388, in_queue=87390, util=100.00%
  nvme2n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme0n2: ios=18/861600, merge=0/0, ticks=1/88004, in_queue=88004, util=100.00%
  nvme3n2: ios=9/861600, merge=0/0, ticks=1/87132, in_queue=87133, util=100.00%
  nvme1n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme4n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n2: ios=10/861600, merge=0/0, ticks=1/86544, in_queue=86546, util=100.00%